{
  name: 'Data.Wars',
  series: 1,
  cards: [
    {type:"script", name: "Recycle", cost: "0", condition: "", effect: "Target user shuffles their trash bin into their drive, and draws a full hand of cards. Discard this card afterwards.", commands: []},
    {type:"daemon", name: "DDiver", cost: "0", condition: "", effect: "While this card is in play, this card’s owner shuffles any discarded .PRG card in play under their control back into their drive.", commands: []},
    {type:"program", name: "ArcMan", cost: "2", condition: "", effect: "If this card executes any command successfully, this card's owner can't issue any more commands until the end of the current turn.", commands: [{name: "undelete", cost: "1", condition: "Issue this command only on having to discard cards from your drive into your trash bin." effect: "Roll a die. If the dice roll value is lesser than 3, discard the amount of cards indicated by the dice roll value instead."}]},
    {type:"script", name: "fsFreeze", cost: "0", condition: "", effect: "Roll a die. If the dice roll value is greater than 3, commands that target any drive are halted immediately until the end of the current turn.", commands: []},
    {type:"script", name: "SysRec", cost: "0", condition: "", effect: "Target user shuffles their hand and trash bin into their drive. Discard this card afterwards.", commands: []},
    {type:"program", name: "drWatson", cost: "1", condition: "", effect: "", commands: [{name: "restore", cost: "0", condition: "", effect: "Shuffle target .PRG card on your desktop back into their owner’s drive. Shuffle this card into their owner's drive afterwards."}]},
    {type:"script", name: "TidyUp", cost: "0", condition: "", effect: "Return all .PRG cards in play back to their owner's hands. Discard this card afterwards.", commands: []},
    {type:"config", name: "cpKiller", cost: "2", condition: "", effect: "", commands: [{killall: "killall", cost: "2", condition: "", effect: "Shuffle all .DAEMON cards in play back into their owner's drives. Discard this card afterwards."}]},
    {type:"config", name: "fbomb", cost: "3", condition: "", effect: "", commands: [{killall: "explode", cost: "0", condition: "", effect: "Discard as many cards from this desktop's drive as you have in your hand. Discard this card alongside any other attached card to it afterwards."}]},
    {type:"script", name: "CRCorrupt", cost: "2", condition: "", effect: "Roll a die. If the dice roll value is greater than 4, discard target .PRG card in play, otherwise discard as many cards from your drive as the dice roll value. Discard this card afterwards.", commands: []},
    {type:"program", name: "ledbomber", cost: "1", condition: "", effect: "", commands: [{name: "overcharge", cost: "", condition: "4", effect: "Target user discards as many cards from their drive as you discard from your hand. Deattach and discard any other cards attached to this card and return this card to their owner's hand afterwards."}]},
    {type:"program", name: "dLiz", cost: "1", condition: "", effect: "", commands: [{name: "expand", cost: "3", condition: "", effect: "This desktop's owner allocates as much memory as .PRG cards you have in play"}]},
    {type:"config", name: "zombify", cost: "2", condition: "", effect: "At the end of their Memory Clean phase, the owner of any .PRG card attached to this card must allocate an extra Memory Point to keep this card in play, otherwise all attached cards must be discarded alongside this card.", commands: []},
    {type:"config", name: "lilProxy", cost: "2", condition: "", effect: "", commands: [{name: "query", cost: "2", condition: "", effect: "Search in your drive for a .CONF card and attach it to any .PRG card in play. Deattach and discard this card afterwards."}]},
    {type:"daemon", name: "Dproxy", cost: "0", condition: "", effect: "", commands: [{name: "port-knock", cost: "0", condition: "", effect: "Search in your drive for a .PRG card and put it in play on your desktop, allocating its base Memory Cost. Shuffle this card into your drive afterwards."}]},
    {type:"program", name: "THORSE", cost: "", condition: "", effect: "If this card is discarded from play, return it to their owner's hand.", commands: [{name: "attach", cost: "0", condition: "", effect: "Attach this card to any .PRG card on this desktop."}, {name: "hop-to", cost: "1x", condition: "To issue this command, allocate as many extra Memory Points as the total amount of the base Memory Cost of all cards attached to this card.", effect: "Put this card, alongside any other card, attached to this card on the target desktop."}]},
    {type:"program", name: "Snitchy", cost: "0", condition: "", effect: "", commands: [{name: "snoop", cost: "0", condition: "", effect: "Reveal to all users the card on top of this desktop's drive."}]},
    {type:"program", name: "SoulSeeker", cost: "3", condition: "", effect: "", commands: [{name: "remote-call", cost: "2x", condition: "To issue this command, allocate as many extra Memory Points as the target command's base Memory Cost.", effect: "Execute target command via this card."}]},
    {type:"", name: "GCMon", cost: "", condition: "This card can only execute commands during their controller’s turn.", effect: "", commands: [{name: "top-priority", cost: "x", condition: "The user that issued this command can't issue any other commands after issuing this command.", effect: "Issue a command from any other card on your desktop via this card allocating half of the Memory Cost it must allocate to resolve as extra Memory Points when issuing this card."}]},
    {type:"program", name: "rootkat", cost: "1", condition: "", effect: "This card can issue commands via any other .PRG card in play on this desktop.", commands: [{name: "jump-thru", cost: "0", condition: "", effect: "Target user discards as many cards as they want from their hand. Roll a die. If the dice roll value is greater than the amount of cards discarded by the target user, deattach this card from any other attached cards and put it on the target user's desktop."}]},
    {type:"daemon", name: "VDoctor", cost: "0", condition: "", effect: "", commands: [{name: "quarantine", cost: "0", condition: "This command can only be executed once per every turn.", effect: "Discard any cards attached to any .PRG card you own in play and put it back into your hand."}]},
    {type:"program", name: "Scramblr", cost: "3", condition: "This card can't be attached to any other card.", effect: "", commands: [{name: "denial", cost: "2", condition: "", effect: "If the target command, .SCRIPT or .DAEMON card halts a command you issued, halt it instead. Discard this card afterwards."}]},
    {type:"program", name: "DrillBitt", cost: "3", condition: "This card can't be attached to any other card.", effect: "", commands: [{name: "force-conf", cost: "3", condition: "", effect: "Roll a die. If the dice roll value is greater than 4, the next .CONF card you execute can target any .PRG card in play."}]},
    {type:"program", name: "KMauler", cost: "", condition: "This card can only execute commands during their controller's turn.", effect: "", commands: [{name: "chomp", cost: "2x", condition: "Halt this command on your hand being empty.", effect: "Roll a die for each extra Memory point allocated. If the dice roll value is equal or greater than 3, target player discards a card of their drive, otherwise you discard one card of your hand."}]},
    {type:"", name: "MSHAp", cost: "3", condition: "", effect: "This card can't be targeted by commands issued via other .PRG cards.", commands: [{name: "drain", cost: "0", condition: "To issue this command, discard any amount of cards from your hand.", effect: "Deallocate as many Memory Points as cards you discard from your hand. Shuffle this card into your drive afterwards."}]},
    {type:"daemon", name: "pgKit", cost: "0", condition: "", effect: "", commands: [{name: "post", cost: "0", condition: "This command can only be issued during the turn of this card’s owner.", effect: "Skip target user’s next turn. Discard this card afterwards."}, {name: "override", cost: "3", condition: "Overrides other commands on resolve.", effect: "Replace any .PRG card under your control as the target of any command targeting that card."}]},
    {type:"script", name: "Lockdown", cost: "0", condition: "", effect: "Halt any command or effect that may discard any .DAEMON or .PRG cards in play until the end of the current turn.", commands: []},
    {type:"program", name: "HVEye", cost: "4", condition: "This card can't change desktops while in play.", effect: "This card’s owner shares control over any .PRG card in play attached to this card.", commands: [{name: "probe-host", cost: "1x", condition: "To issue this command, allocate as many extra Memory Points as the base Memory Cost of the target .PRG card in play.", effect: "Attach this card to the target .PRG card."}]},
    {type:"program", name: "PolyAgent", cost: "4", condition: "", effect: "", commands: [{name: "spoof", cost: "1x", condition: "To issue this command, allocate as many extra Memory Points as the base Memory Cost of the target .PRG card.", effect: "Transform into a copy of the target .PRG card until the end of your next turn."}]},
    {type:"script", name: "RemoteSync", cost: "", condition: "", effect: "Target user draws a card from their drive. Discard this card afterwards.", commands: []},
    {type:"daemon", name: "MrDLMan", cost: "", condition: "During the turn of this desktop's user, all card effects duplicate the amount of cards drawn.", effect: "", commands: [{name: "clear", cost: "0", condition: "", effect: "Roll a die. If the dice roll value is higher than 2, shuffle your hand into your drive. Discard one card from your hand otherwise."}]},
    {type:"daemon", name: "ReSH", cost: "0", condition: "This desktop's user must allocate an extra Memory Point in order to issue commands via cards in play outside of this desktop.", effect: "", commands: [{name: "sync", cost: "x", condition: "Overrides other commands on resolve.\nTo issue this command, allocate an amount of Memory Points equal to the Base Memory Cost of the next .CONF card you play.", effect: "The next .CONF card you play can target any .PRG card from outside of your desktop."}]},
    {type:"program", name: "vultor", cost: "2", condition: "", effect: "If this desktop's trash bin is empty, return this card back to their owner's hands.", commands: [{name: "scavenge", cost: "2", condition: "", effect: "Put target .SCRIPT card in this desktop's trash bin back into their owner's hand. Discard this card afterwards."}]},
    {type:"config", name: "data-dl", cost: "1", condition: "", effect: "", commands: [{name: "fetch", cost: "2", condition: "", effect: "Target user draws a card from their drive"}]},
    {type:"script", name: "WipeOut", cost: "0", condition: "", effect: "Discard all .PRG cards in play from outside of their owner's desktops. Discard this card afterwards.", commands: []},
    {type:"daemon", name: "pgCOLI", cost: "0", condition: "The effects of any command executed via any .DAEMON, .PRG or .CONF cards controlled issued by any user other than this card's owner won't affect this card on resolve.", effect: "", commands: [{name: "This command can only be executed once per every turn. ", cost: "", condition: "", effect: "Deallocate half of your allocated Memory Points."}]},
    {type:"script", name: "bruteforce", cost: "", condition: "", effect: "Target user rolls a die. If the dice roll value is equal or greater than 4, they discard as many cards from their drive as the dice roll value indicates, otherwise you discard as many cards from your hand as the roll dice value indicates. Discard this card afterwards.", commands: []},
    {type:"config", name: "rktSaver", cost: "3", condition: "Neither this card nor any attached .PRG cards can be discarded by effects of commands executed via .PRG, .DAEMON or other .CONF cards not attached to this card.", effect: "", commands: [{name: "sacrifice", cost: "2", condition: "", effect: "If a .DAEMON card in play under your control gets discarded, discard this card and return any other attached cards back to their owner's hands instead. You can't execute any other commands during the turn this command resolves."}]},
    {type:"script", name: "FileFlare", cost: "2x", condition: "To issue this card, allocate 5 or less extra Memory Points.", effect: "Target user rolls a die. If the dice roll value is greater than the amount of extra Memory Points allocated, target user discards as many cards from their drive as the dice roll value indicates, otherwise you discard as many cards from your drive as extra Memory Points you allocated. Discard this card afterwards.", commands: []},
    {type:"script", name: "binSummon", cost: "0", condition: "", effect: "Search in your drive for a .DAEMON card and put it in play, discarding any other .DAEMON card in play on your desktop if needed to play the chosen .DAEMON card. Shuffle your drive and discard this card afterwards.", commands: []},
    {type:"script", name: "Sweeper", cost: "0", condition: "", effect: "Target user deallocates half of their allocated Memory Points. Discard this card afterwards.", commands: []},
    {type:"script", name: "reconf", cost: "x", condition: "To execute this card, allocate as many extra Memory Points as the Base Memory Cost of the target .CONF card in your trash bin.", effect: "Put target .CONF card in your trash bin back into your hand. Discard this card afterwards.", commands: []},
    {type:"script", name: "rDaemon", cost: "0", condition: "", effect: "Shuffle target .DAEMON card in your trash bin back into your drive. Discard this card afterwards.", commands: []},
    {type:"config", name: "overbloat", cost: "3", condition: "To issue commands via any card attached to this card, the user issuing the command must allocate an extra Memory Point.", effect: "", commands: []},
    {type:"script", name: "memSkip", cost: "0", condition: "To execute this card, you must discard one .PRG card in play under your control.", effect: "Target user skips their next Memory Cleanup step. Discard this card afterwards.", commands: []},
    {type:"script", name: "ClipUp", cost: "0", condition: "", effect: "Target user rolls a die. If the dice roll value is equal or greater than the target card's Base Memory Cost, the the target card's owner skips the target card's next Memory Cleanup step.", commands: []},
    {type:"program", name: "brokerman", cost: "2", condition: "This card can only execute commands during their controller's turn.", effect: "If this card gets discarded from play, this desktop's user shuffles their hand into their drive.", commands: [{name: "burst", cost: "2", condition: "", effect: "Roll a die. If the dice roll value is greater than 3, target user discards as many cards from their drive as the amount of cards you have in your hand."}]},
    {type:"program", name: "huVolt", cost: "2", condition: "This card can only execute commands during their controller's turn.", effect: "If this card is attached to any other card, at the beginning of each turn, this desktop's user chooses to either return it to their owner's hand or discard one card from their drive, otherwise this card is discarded.", commands: [{name: "wave", cost: "2", condition: "", effect: "Roll a die. If the dice roll value is greater than 3, target user discards as many cards from their hand as .PRG card on this desktop."}]},
    {type:"program", name: "MonkeyBuddy", cost: "2", condition: "", effect: "", commands: [{name: "uninstall", cost: "1", condition: "Only this desktop's user can issue this command, regardless of their control over this card.", effect: "Take control over this card and put it on the target desktop."}]},
    {type:"config", name: "SgtWally", cost: "1", condition: "", effect: "While this card is in play, users can't execute commands via cards outside of their desktops.", commands: [{name: "allow-exception", cost: "2x", condition: "To issue this command, you must allocate the Base Memory Cost of the target command.", effect: "Execute target command via this card. Discard this card afterwards."}]},
    {type:"script", name: "fork", cost: "0", condition: "", effect: "Transform this card into the target .PRG card and put it in play on your desktop in Idle state. Discard this card at the end of the current turn.", commands: []},
    {type:"config", name: "DragNDrop", cost: "0", condition: "This card's owner shares control over any .PRG card attached to this card.", effect: "", commands: [{name: "drop", cost: "0", condition: "", effect: "Return this card and all other attached cards to their owner's hands."}]},
    {type:"script", name: "fileloss", cost: "1", condition: "", effect: "Target user discard either one card from their hand or their drive. Discard this card afterwards.", commands: []},
    {type:"script", name: "zerofill", cost: "1", condition: "", effect: "Target user discards their hand. Discard this card afterwards.", commands: []},
    {type:"config", name: "DataScrubber", cost: "1", condition: "Return all other cards that aren’t .PRG cards attached to this card to their owner’s hands. No new cards can be attached to this card.", effect: "", commands: [{name: "reset", cost: "", condition: "To issue this command, allocate as many extra Memory Points as the total amount of the Base Memory Cost of the attached .PRG card.", effect: "Return all attached cards other than .PRG cards to their owner’s hand."}]},
    {type:"program", name: "dummyboy", cost: "0", condition: "When this card comes into play, discard any other copies of this card in play.\nThis card can only execute commands during their owner's turn.\nWhile this card is in play, any effects or commands that target any .PRG card controlled by this desktop's user are targeted towards this card on resolve instead.", effect: "", commands: [{name: "taunt", cost: "x", condition: "To issue this command, you must allocate any extra amount of Memory Points.", effect: "If this card is discarded before your next turn, all other users discard as many cards from their drives as extra Memory Points you allocated when issuing this command, otherwise you discard that amount from your drive, alongside this card."}]},
    {type:"script", name: "heatup", cost: "0", condition: "", effect: "Target user rolls a die. If the dice roll value is equal or greater than their allocated Memory Points, then they discard as many cards from their drive as the dice roll value indicates, otherwise you discard as many cards from your drive as allocated Memory Points the target user has. Discard this card afterwards.", commands: []},
    {type:"daemon", name: "Eppy", cost: "0", condition: "", effect: "While this card is in play, no new .PRG, .DAEMON or .CONF cards can be out in play by any user. If this card is the only card in play, discard this card.", commands: [{name: "forget", cost: "1x", condition: "To issue this command, you must allocate as many extra memory points as cards in your hand.", effect: "Shuffle this card back into your deck."}]},
    {type:"config", name: "RootAccess", cost: "2", condition: "", effect: "This card's owner shares control over any .PRG card in play attached to this card.", commands: [{name: "terminate", cost: "3", condition: "Any user controlling any card attached to this card can issue this command during their turn.", effect: "Return this card to their owner's hand."}]},
    {type:"script", name: "Defrag", cost: "0", condition: "", effect: "Target user shuffles their hand into their drive, and draws as many cards as they choose until having a full hand. Discard this card afterwards.", commands: []}
  ]
}
